{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_5","layers":[{"class_name":"Dense","config":{"units":1024,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense10","trainable":true,"batch_input_shape":[null,42],"dtype":"float32"}},{"class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense11","trainable":true,"batch_input_shape":[null,1024],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"dropout_Dropout4","trainable":true}},{"class_name":"Dense","config":{"units":10,"activation":"softmax","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense12","trainable":true}}]},"keras_version":"tfjs-layers 3.20.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.20.0","convertedBy":null,"weightData":"","weightSpecs":[{"name":"dense10/kernel","shape":[42,1024],"dtype":"float32"},{"name":"dense10/bias","shape":[1024],"dtype":"float32"},{"name":"dense11/kernel","shape":[1024,128],"dtype":"float32"},{"name":"dense11/bias","shape":[128],"dtype":"float32"},{"name":"dense12/kernel","shape":[128,10],"dtype":"float32"}],"weightsManifest":[{"paths":["./weight.bin"],"weights":[{"name":"dense10/kernel","shape":[42,1024],"dtype":"float32"},{"name":"dense10/bias","shape":[1024],"dtype":"float32"},{"name":"dense11/kernel","shape":[1024,128],"dtype":"float32"},{"name":"dense11/bias","shape":[128],"dtype":"float32"},{"name":"dense12/kernel","shape":[128,10],"dtype":"float32"}]}]}